docs/benchmark/results-wrk2/raw/gateway-R150000-r1.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   147.55ms  296.61ms   1.68s    86.51%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.14ms
 75.000%   69.31ms
 90.000%  621.57ms
 99.000%    1.23s
 99.900%    1.44s
 99.990%    1.55s
 99.999%    1.62s
100.000%    1.68s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.074     0.000000            1         1.00
       1.222     0.100000       117797         1.11
       2.000     0.200000       235512         1.25
       3.701     0.300000       353274         1.43
       8.423     0.400000       471150         1.67
      13.135     0.500000       588866         2.00
      15.615     0.550000       647633         2.22
      18.271     0.600000       706600         2.50
      21.551     0.650000       765508         2.86
      26.431     0.700000       824290         3.33
      69.311     0.750000       883104         4.00
     137.727     0.775000       912566         4.44
     211.839     0.800000       942006         5.00
     296.191     0.825000       971475         5.71
     382.463     0.850000      1000869         6.67
     490.495     0.875000      1030285         8.00
     552.447     0.887500      1045000         8.89
     621.567     0.900000      1059721        10.00
     688.127     0.912500      1074462        11.43
     753.663     0.925000      1089181        13.33
     822.271     0.937500      1103879        16.00
     860.671     0.943750      1111274        17.78
     902.143     0.950000      1118623        20.00
     946.687     0.956250      1125952        22.86
     994.303     0.962500      1133327        26.67
    1043.967     0.968750      1140695        32.00
    1069.055     0.971875      1144427        35.56
    1092.607     0.975000      1148061        40.00
    1117.183     0.978125      1151706        45.71
    1143.807     0.981250      1155431        53.33
    1172.479     0.984375      1159162        64.00
    1187.839     0.985938      1160998        71.11
    1204.223     0.987500      1162825        80.00
    1221.631     0.989062      1164668        91.43
    1241.087     0.990625      1166498       106.67
    1262.591     0.992188      1168255       128.00
    1275.903     0.992969      1169242       142.22
    1289.215     0.993750      1170149       160.00
    1303.551     0.994531      1171017       182.86
    1319.935     0.995313      1171981       213.33
    1336.319     0.996094      1172854       256.00
    1346.559     0.996484      1173339       284.44
    1357.823     0.996875      1173810       320.00
    1369.087     0.997266      1174262       365.71
    1381.375     0.997656      1174700       426.67
    1397.759     0.998047      1175186       512.00
    1404.927     0.998242      1175391       568.89
    1414.143     0.998437      1175628       640.00
    1424.383     0.998633      1175866       731.43
    1434.623     0.998828      1176083       853.33
    1445.887     0.999023      1176324      1024.00
    1452.031     0.999121      1176439      1137.78
    1459.199     0.999219      1176557      1280.00
    1465.343     0.999316      1176662      1462.86
    1472.511     0.999414      1176773      1706.67
    1482.751     0.999512      1176885      2048.00
    1487.871     0.999561      1176945      2275.56
    1494.015     0.999609      1176998      2560.00
    1501.183     0.999658      1177054      2925.71
    1508.351     0.999707      1177123      3413.33
    1514.495     0.999756      1177168      4096.00
    1518.591     0.999780      1177204      4551.11
    1522.687     0.999805      1177228      5120.00
    1526.783     0.999829      1177253      5851.43
    1533.951     0.999854      1177285      6826.67
    1539.071     0.999878      1177312      8192.00
    1543.167     0.999890      1177326      9102.22
    1548.287     0.999902      1177340     10240.00
    1555.455     0.999915      1177353     11702.86
    1563.647     0.999927      1177367     13653.33
    1568.767     0.999939      1177383     16384.00
    1572.863     0.999945      1177394     18204.44
    1574.911     0.999951      1177396     20480.00
    1579.007     0.999957      1177404     23405.71
    1581.055     0.999963      1177410     27306.67
    1588.223     0.999969      1177418     32768.00
    1592.319     0.999973      1177421     36408.89
    1597.439     0.999976      1177425     40960.00
    1605.631     0.999979      1177429     46811.43
    1608.703     0.999982      1177432     54613.33
    1616.895     0.999985      1177438     65536.00
    1616.895     0.999986      1177438     72817.78
    1618.943     0.999988      1177439     81920.00
    1623.039     0.999989      1177442     93622.86
    1625.087     0.999991      1177443    109226.67
    1628.159     0.999992      1177445    131072.00
    1628.159     0.999993      1177445    145635.56
    1629.183     0.999994      1177446    163840.00
    1630.207     0.999995      1177447    187245.71
    1634.303     0.999995      1177448    218453.33
    1635.327     0.999996      1177449    262144.00
    1635.327     0.999997      1177449    291271.11
    1646.591     0.999997      1177450    327680.00
    1646.591     0.999997      1177450    374491.43
    1653.759     0.999998      1177451    436906.67
    1653.759     0.999998      1177451    524288.00
    1653.759     0.999998      1177451    582542.22
    1673.215     0.999998      1177452    655360.00
    1673.215     0.999999      1177452    748982.86
    1673.215     0.999999      1177452    873813.33
    1673.215     0.999999      1177452   1048576.00
    1673.215     0.999999      1177452   1165084.44
    1679.359     0.999999      1177453   1310720.00
    1679.359     1.000000      1177453          inf
#[Mean    =      147.546, StdDeviation   =      296.614]
#[Max     =     1678.336, Total count    =      1177453]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1177457 requests in 15.00s, 752.35MB read
Requests/sec:  78489.96
Transfer/sec:     50.15MB