docs/benchmark/results-wrk2/raw/gateway-R50000-r3.txt
Running 15s test @ http://127.0.0.1:8080/
  4 threads and 10000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.71ms    4.61ms  59.71ms   90.94%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.49ms
 75.000%    3.71ms
 90.000%    7.89ms
 99.000%   24.16ms
 99.900%   44.03ms
 99.990%   56.29ms
 99.999%   59.62ms
100.000%   59.74ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.115     0.000000            1         1.00
       0.880     0.100000        44198         1.11
       1.305     0.200000        88359         1.25
       1.688     0.300000       132379         1.43
       2.055     0.400000       176652         1.67
       2.495     0.500000       220684         2.00
       2.727     0.550000       242852         2.22
       2.945     0.600000       264764         2.50
       3.169     0.650000       286981         2.86
       3.419     0.700000       308857         3.33
       3.713     0.750000       330935         4.00
       3.887     0.775000       342056         4.44
       4.077     0.800000       352999         5.00
       4.355     0.825000       364036         5.71
       4.991     0.850000       375080         6.67
       6.355     0.875000       386089         8.00
       7.255     0.887500       391610         8.89
       7.887     0.900000       397107        10.00
       8.487     0.912500       402644        11.43
       9.167     0.925000       408189        13.33
      10.343     0.937500       413675        16.00
      11.711     0.943750       416420        17.78
      12.727     0.950000       419169        20.00
      13.551     0.956250       421927        22.86
      14.423     0.962500       424700        26.67
      15.823     0.968750       427436        32.00
      17.103     0.971875       428817        35.56
      18.015     0.975000       430201        40.00
      18.799     0.978125       431593        45.71
      19.647     0.981250       432962        53.33
      21.407     0.984375       434333        64.00
      22.367     0.985938       435022        71.11
      23.119     0.987500       435707        80.00
      23.727     0.989062       436398        91.43
      24.383     0.990625       437095       106.67
      25.359     0.992188       437777       128.00
      26.511     0.992969       438122       142.22
      27.711     0.993750       438465       160.00
      28.591     0.994531       438816       182.86
      29.391     0.995313       439156       213.33
      31.791     0.996094       439500       256.00
      32.991     0.996484       439674       284.44
      33.983     0.996875       439845       320.00
      35.455     0.997266       440017       365.71
      37.503     0.997656       440191       426.67
      38.783     0.998047       440368       512.00
      39.551     0.998242       440447       568.89
      41.183     0.998437       440533       640.00
      42.527     0.998633       440621       731.43
      43.391     0.998828       440705       853.33
      44.095     0.999023       440792      1024.00
      44.927     0.999121       440837      1137.78
      46.079     0.999219       440879      1280.00
      47.167     0.999316       440921      1462.86
      47.935     0.999414       440964      1706.67
      48.351     0.999512       441008      2048.00
      48.607     0.999561       441029      2275.56
      49.023     0.999609       441050      2560.00
      49.343     0.999658       441072      2925.71
      50.303     0.999707       441094      3413.33
      51.775     0.999756       441115      4096.00
      52.479     0.999780       441126      4551.11
      53.055     0.999805       441136      5120.00
      53.727     0.999829       441148      5851.43
      53.887     0.999854       441158      6826.67
      54.943     0.999878       441169      8192.00
      55.423     0.999890       441174      9102.22
      56.287     0.999902       441179     10240.00
      56.639     0.999915       441185     11702.86
      57.247     0.999927       441190     13653.33
      57.951     0.999939       441196     16384.00
      58.335     0.999945       441198     18204.44
      58.431     0.999951       441203     20480.00
      58.463     0.999957       441205     23405.71
      58.495     0.999963       441207     27306.67
      58.559     0.999969       441209     32768.00
      58.591     0.999973       441210     36408.89
      58.655     0.999976       441212     40960.00
      58.687     0.999979       441213     46811.43
      58.783     0.999982       441214     54613.33
      59.519     0.999985       441216     65536.00
      59.519     0.999986       441216     72817.78
      59.551     0.999988       441217     81920.00
      59.615     0.999989       441218     93622.86
      59.615     0.999991       441218    109226.67
      59.647     0.999992       441219    131072.00
      59.647     0.999993       441219    145635.56
      59.711     0.999994       441220    163840.00
      59.711     0.999995       441220    187245.71
      59.711     0.999995       441220    218453.33
      59.743     0.999996       441222    262144.00
      59.743     1.000000       441222          inf
#[Mean    =        3.713, StdDeviation   =        4.609]
#[Max     =       59.712, Total count    =       441222]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  441715 requests in 15.04s, 282.24MB read
Requests/sec:  29374.65
Transfer/sec:     18.77MB